I cannot reproduce this with the latest (**v0.12.0**) version of the provider:

```console
% terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with
the following symbols:
  + create

Terraform will perform the following actions:

  # awscc_route53resolver_firewall_domain_list.always_allowed_domains_list will be created
  + resource "awscc_route53resolver_firewall_domain_list" "always_allowed_domains_list" {
      + arn                = (known after apply)
      + creation_time      = (known after apply)
      + creator_request_id = (known after apply)
      + domain_count       = (known after apply)
      + domains            = [
          + "amazonaws.com",
        ]
      + id                 = (known after apply)
      + managed_owner_name = (known after apply)
      + modification_time  = (known after apply)
      + name               = "ALWAYS_ALLOWED_DOMAINS"
      + status             = (known after apply)
      + status_message     = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

awscc_route53resolver_firewall_domain_list.always_allowed_domains_list: Creating...
awscc_route53resolver_firewall_domain_list.always_allowed_domains_list: Still creating... [10s elapsed]
awscc_route53resolver_firewall_domain_list.always_allowed_domains_list: Still creating... [20s elapsed]
awscc_route53resolver_firewall_domain_list.always_allowed_domains_list: Creation complete after 21s [id=rslvr-fdl-bf824b44dd0e40b3]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
% terraform plan

awscc_route53resolver_firewall_domain_list.always_allowed_domains_list: Refreshing state... [id=rslvr-fdl-bf824b44dd0e40b3]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # awscc_route53resolver_firewall_domain_list.always_allowed_domains_list has been changed
  ~ resource "awscc_route53resolver_firewall_domain_list" "always_allowed_domains_list" {
        id                = "rslvr-fdl-bf824b44dd0e40b3"
        name              = "ALWAYS_ALLOWED_DOMAINS"
      ~ status            = "UPDATING" -> "COMPLETE"
      ~ status_message    = "Updating the Firewall Domain List" -> "Finished domain list update"
        # (5 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using
ignore_changes, the following plan may include actions to undo or respond to these changes.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

No changes. Your infrastructure matches the configuration.

Your configuration already matches the changes detected above. If you'd like to update the Terraform state to match,
create and apply a refresh-only plan:
  terraform apply -refresh-only
```